import requests
# з модуля "read_json" імпортуємо функцію "read_json"
from .read_json import read_json
#імпортуємо json
import json
#
data_api = read_json(name_file= 'config_api.json')
#(константа) апі_ключ, який надає змогу під'єднатися до віддаленого серверу задля отримання потрібної нам інформації
API_KEY = data_api['api_key']
#(константа) назва міста, яке служить нам як ключове слово для віднаходження потрібної нам інформації. (тобто ми не будемо отримувати інформацію про інші міста, крім того, яке ми вказали в папці "static")
CITY_NAME = data_api['city_name']
"""
Данні константи ми вказуємо у файлі "config_api.json", який знаходиться в папці "static".
"""

#Записуємо до константи посилання, вставляючи в нього константні значення назви_міста та апі_ключа.
URL = f"https://api.openweathermap.org/data/2.5/weather?q={CITY_NAME}&appid={API_KEY}"
#отримуємо данні з віддаленого репозиторію по URL адрессі.
response = requests.get(URL)
#якщо статус коду настрого дорівнює значенню 200:
if response.status_code == 200:
    #перетворюємо байт рядок в тип данних "бібліотека".
    data_dict = json.loads(response.content)
    #перетворюємо в рядковий тип данних бібліотеку "data_dict", вказану в дужках функції й команда print прописує її у терміналі. Оператор "indent" вказує кількість відступів (4) для кращого перегляду.
    print(json.dumps(data_dict, indent= 4))